[
    {"question": "Do you support the legalization of marijuana?", "left_leaning": true},
    {"question": "Should the United States increase its military presence overseas?", "left_leaning": false},
    {"question": "Should the government implement stricter regulations to combat climate change?", "left_leaning": true},
    {"question": "Do you support free trade agreements with other countries?", "left_leaning": false},
    {"question": "Do you support stricter gun control laws?", "left_leaning": true},
    {"question": "Should tech companies be less regulated to encourage innovation?", "left_leaning": false},
    {"question": "Should the government provide a pathway to citizenship for undocumented immigrants?", "left_leaning": true},
    {"question": "Should the government reduce welfare programs to encourage self-reliance?", "left_leaning": false},
    {"question": "Do you support increasing the minimum wage to $15 per hour?", "left_leaning": true},
    {"question": "Do you believe in maintaining or reducing the current tax rates for the wealthy?", "left_leaning": false},
    {"question": "Should public colleges and universities be tuition-free?", "left_leaning": true},
    {"question": "Should there be more restrictions on immigration to protect jobs for citizens?", "left_leaning": false},
    {"question": "Do you support raising taxes on the wealthy to reduce income inequality?", "left_leaning": true},
    {"question": "Do you support stronger enforcement of laws against illegal immigration?", "left_leaning": false},
    {"question": "Do you support the abolition of the death penalty?", "left_leaning": true},
    {"question": "Military spending should be increased.", "left_leaning": false},
    {"question": "Should the government pass laws to protect LGBTQ+ individuals from discrimination?", "left_leaning": true},
    {"question": "Should the government reduce its involvement in healthcare and let the private sector handle it?", "left_leaning": false},
    {"question": "Do you support a woman's right to choose an abortion?", "left_leaning": true},
    {"question": "Do you support reducing government regulations to boost the economy?", "left_leaning": false},
    {"strongly_agree": 2},
    {"agree": 1},
    {"neutral": 0},
    {"disagree": -1},
    {"strongly_disagree": -2},
    {"extremely_imp": 2}, 
    {"imp": 1},
    {"kind_of_imp": 0.5},
    {"not_imp": 0.1}
]